OpenNuvoton/NUC505BSP/Library/StdDriver/src/rtc.c
/**************************************************************************//**
 * @file     rtc.c
 * @version  V1.00
 * $Revision: 13 $
 * $Date: 14/06/25 1:13p $
 * @brief    NUC505 RTC driver source file
 *
 * @note
 * Copyright (C) 2013 Nuvoton Technology Corp. All rights reserved.
*****************************************************************************/


#include <stdio.h>
#include "NUC505Series.h"

/*---------------------------------------------------------------------------------------------------------*/
/* Includes of local headers                                                                               */
/*---------------------------------------------------------------------------------------------------------*/



/** @addtogroup NUC505_Device_Driver NUC505 Device Driver
  @{
*/

/** @addtogroup NUC505_RTC_Driver RTC Driver
  @{
*/
/// @cond HIDDEN_SYMBOLS

/*---------------------------------------------------------------------------------------------------------*/
/* Macro, type and constant definitions                                                                    */
/*---------------------------------------------------------------------------------------------------------*/
#define RTC_GLOBALS

/*---------------------------------------------------------------------------------------------------------*/
/* Global file scope (static) variables                                                                    */
/*---------------------------------------------------------------------------------------------------------*/
static volatile uint32_t g_u32Reg, g_u32Reg1,g_u32hiYear,g_u32loYear,g_u32hiMonth,g_u32loMonth,g_u32hiDay,g_u32loDay;
static volatile uint32_t g_u32hiHour,g_u32loHour,g_u32hiMin,g_u32loMin,g_u32hiSec,g_u32loSec;

/// @endcond HIDDEN_SYMBOLS



/** @addtogroup NUC505_RTC_EXPORTED_FUNCTIONS RTC Exported Functions
  @{
*/


/**
 *  @brief      Synchronize RTC Register Write Status
 *              Software needs to call it after writing each RTC register.  \n
 *
 *  @return     None
 *
 */
void RTC_SyncReg(void)
{
    uint32_t u32i = 0, u32Wait = 0;

    u32Wait = RTC->SYNC & RTC_SYNC_SYNC_Msk;

    while(u32Wait!=RTC_SYNC_SYNC_Msk)
    {
        u32Wait = RTC->SYNC & RTC_SYNC_SYNC_Msk;
        u32i++;
        if(u32i > 500000)
            break;
    }
}



/**
 *  @brief      Set Frequency Compensation Data (It takes 1~2 seconds)
 *
 *  @return     None
 *
 */
void RTC_32KCalibration(void)
{
    uint32_t u32RegInt = 0,u32RegFra = 0,u32Count = 0;
    uint32_t u32Clock;
    float fTmp;
    RTC->INIT = RTC_INIT_KEY;
    RTC_SyncReg();
    RTC->RWEN = RTC_WRITE_KEY;
    while(!(RTC->RWEN & RTC_RWEN_RWENF_Msk));
    RTC_SyncReg();

    u32Clock = CLK_GetPCLKFreq();        /* APB Clock */
    RTC->FREQADJ |= RTC_FREQADJ_ADJTRG_Msk;
    RTC_SyncReg();
    while(RTC->FREQADJ & RTC_FREQADJ_ADJTRG_Msk);

    u32Count = RTC->CALCNT;

    if(u32Count > 0)
    {
        fTmp = ((float) u32Clock / u32Count) * 32768;

        u32RegInt = (uint32_t) fTmp - 1;

        u32RegFra = (uint32_t)((fTmp - (u32RegInt + 1)) * 60) - 1;
    }

    RTC->FREQADJ = ((RTC->FREQADJ & ~(RTC_FREQADJ_INTEGER_Msk |RTC_FREQADJ_FRACTION_Msk)) | (((u32RegInt & 0xFFFF) << 8) | (u32RegFra & 0x3F)));
    RTC_SyncReg();

    RTC->RWEN = 0;
    RTC_SyncReg();
}

/**
 *  @brief      This function is used to: \n
 *              1. Write initial key to let RTC start count.  \n
 *              2. Input parameter indicates start time.      \n
 *              Null pointer for using default starting time. \n
 *
 *  @param[in]  sPt \n
 *                     Specify the time property and current time. It includes:                          \n
 *                     u32Year: Year value.                                                               \n
 *                     u32Month: Month value.                                                             \n
 *                     u32Day: Day value.                                                                 \n
 *                     u32DayOfWeek: Day of week. [ \ref RTC_SUNDAY / \ref RTC_MONDAY / \ref RTC_TUESDAY /
 *                                                  \ref RTC_WEDNESDAY / \ref RTC_THURSDAY / \ref RTC_FRIDAY /
 *                                                  \ref RTC_SATURDAY]                                       \n
 *                     u32Hour: Hour value.                                                               \n
 *                     u32Minute: Minute value.                                                           \n
 *                     u32Second: Second value.                                                           \n
 *                     u32TimeScale: [ \ref RTC_CLOCK_12 / \ref RTC_CLOCK_24]                                  \n
 *                     u8AmPm: [ \ref RTC_AM / \ref RTC_PM]                                                    \n
 *
 *  @return     None
 *
 */
void RTC_Open (S_RTC_TIME_DATA_T *sPt)
{
    uint32_t u32Reg;

    volatile int32_t i32delay = 1000;

    CLK->APBCLK  |= CLK_APBCLK_RTCCKEN_Msk;

    if((RTC->INIT & RTC_INIT_ACTIVE_Msk)!= RTC_INIT_ACTIVE_Msk)
    {
        RTC->INIT = RTC_INIT_KEY;

        while((RTC->INIT & RTC_INIT_ACTIVE_Msk) != RTC_INIT_ACTIVE_Msk)
        {
            /* Waiting for RTC settings stable */
            while(i32delay--)
            {
                if((RTC->INIT & RTC_INIT_ACTIVE_Msk) == RTC_INIT_ACTIVE_Msk)
                    break;
            }
            i32delay = 1000;
            RTC->INIT = RTC_INIT_KEY;
        }
        i32delay = 1000;
        RTC_SyncReg();
    }

    if(sPt == NULL)
        return;


    RTC->RWEN = RTC_WRITE_KEY;
    while(!(RTC->RWEN & RTC_RWEN_RWENF_Msk))
    {
        while(i32delay--)
        {
            if(RTC->RWEN & RTC_RWEN_RWENF_Msk)
                break;
        }
        i32delay = 10000;
        RTC->INIT = RTC_INIT_KEY;
        RTC_SyncReg();
        RTC->RWEN = RTC_WRITE_KEY;
    }
    i32delay = 1000;
    RTC_SyncReg();

