OpenNuvoton/NUC505BSP/Library/StdDriver/src/rtc.c
        u32Tmp = (g_u32hiMin  * 10);
        u32Tmp+= g_u32loMin;
        sPt->u32Minute = u32Tmp;

        u32Tmp = (g_u32hiSec  * 10);
        u32Tmp+= g_u32loSec;
        sPt->u32Second = u32Tmp;

    }
    else
    {
        /* RTC_CLOCK_24 */
        u32Tmp  = (g_u32hiHour * 10);
        u32Tmp += g_u32loHour;
        sPt->u32Hour = u32Tmp;

        u32Tmp  = (g_u32hiMin * 10);
        u32Tmp +=  g_u32loMin;
        sPt->u32Minute = u32Tmp;

        u32Tmp  = (g_u32hiSec * 10);
        u32Tmp += g_u32loSec;
        sPt->u32Second = u32Tmp;
    }
    RTC->RWEN = 0;
    RTC_SyncReg();
}



/**
 *  @brief      Read alarm date/time from RTC setting
 *
 *  @param[out]  sPt \n
 *                     Specify the time property and current time. It includes:                          \n
 *                     u32Year: Year value.                                                               \n
 *                     u32Month: Month value.                                                             \n
 *                     u32Day: Day value.                                                                 \n
 *                     u32DayOfWeek: Day of week. [ \ref RTC_SUNDAY / \ref RTC_MONDAY / \ref RTC_TUESDAY /
 *                                                  \ref RTC_WEDNESDAY / \ref RTC_THURSDAY / \ref RTC_FRIDAY /
 *                                                  \ref RTC_SATURDAY]                                       \n
 *                     u32Hour: Hour value.                                                               \n
 *                     u32Minute: Minute value.                                                           \n
 *                     u32Second: Second value.                                                           \n
 *                     u32TimeScale: [ \ref RTC_CLOCK_12 / \ref RTC_CLOCK_24]                                  \n
 *                     u8AmPm: [ \ref RTC_AM / \ref RTC_PM]                                                    \n
 *
 *  @return     None                                              \n
 *
 */
void RTC_GetAlarmDateAndTime(S_RTC_TIME_DATA_T *sPt)
{
    uint32_t u32Tmp;
    RTC->INIT = RTC_INIT_KEY;
    RTC_SyncReg();

    RTC->RWEN = RTC_WRITE_KEY;
    while(!(RTC->RWEN & RTC_RWEN_RWENF_Msk));
    RTC_SyncReg();

    sPt->u32TimeScale = RTC->CLKFMT & RTC_CLKFMT_24HEN_Msk;              /* 12/24-hour */
    sPt->u32DayOfWeek = RTC->WEEKDAY & RTC_WEEKDAY_WEEKDAY_Msk;          /* Day of week */

    if(RTC->CALM & RTC_CALM_MSKYEAR_Msk)
        sPt->u32Year = RTC_ALARM_MASK;
    else
    {
        g_u32hiYear  = (RTC->CALM & RTC_CALM_TENYEAR_Msk) >> RTC_CALM_TENYEAR_Pos;
        g_u32loYear  = (RTC->CALM & RTC_CALM_YEAR_Msk)    >> RTC_CALM_YEAR_Pos;
        u32Tmp  = (g_u32hiYear * 10);                                    /* Compute to 20XX year */
        u32Tmp += g_u32loYear;
        sPt->u32Year = u32Tmp + RTC_YEAR2000;
    }

    if(RTC->CALM & RTC_CALM_MSKMON_Msk)
        sPt->u32Month = RTC_ALARM_MASK;
    else
    {
        g_u32hiMonth = (RTC->CALM & RTC_CALM_TENMON_Msk)  >> RTC_CALM_TENMON_Pos;
        g_u32loMonth = (RTC->CALM & RTC_CALM_MON_Msk)     >> RTC_CALM_MON_Pos;
        u32Tmp = (g_u32hiMonth * 10);                                    /* Compute 0~12 month */
        sPt->u32Month = u32Tmp + g_u32loMonth;

    }
    if(RTC->CALM & RTC_CALM_MSKMON_Msk)
        sPt->u32Day = RTC_ALARM_MASK;
    else
    {
        g_u32hiDay   = (RTC->CALM & RTC_CALM_TENDAY_Msk)  >> RTC_CALM_TENDAY_Pos;
        g_u32loDay   = (RTC->CALM & RTC_CALM_DAY_Msk);
        u32Tmp = (g_u32hiDay * 10);                                        /* Compute 0~31 day */
        sPt->u32Day = u32Tmp + g_u32loDay;
    }

    if(RTC->TALM & RTC_TALM_MSKHR_Msk)
        sPt->u32Hour  = RTC_ALARM_MASK;
    else
    {
        g_u32hiHour   =  (RTC->TALM & RTC_TALM_TENHR_Msk)  >> RTC_TALM_TENHR_Pos;
        g_u32loHour   =  (RTC->TALM & RTC_TALM_HR_Msk)     >> RTC_TALM_HR_Pos;

        if (sPt->u32TimeScale == RTC_CLOCK_12)                             /* Compute12/24 hour */
        {
            u32Tmp  = (g_u32hiHour * 10);
            u32Tmp += g_u32loHour;
            sPt->u32Hour = u32Tmp;                                        /* AM: 1~12. PM: 21~32. */

            if (sPt->u32Hour >= 21)
            {
                sPt->u32AmPm  = RTC_PM;
                sPt->u32Hour -= 20;
            }
            else
            {
                sPt->u32AmPm = RTC_AM;
            }
        }
        else
        {
            /* RTC_CLOCK_24 */
            u32Tmp  = (g_u32hiHour * 10);
            u32Tmp +=  g_u32loHour;
            sPt->u32Hour = u32Tmp;
        }

    }
    if(RTC->TALM & RTC_TALM_MSKMIN_Msk)
        sPt->u32Minute = RTC_ALARM_MASK;
    else
    {
        g_u32hiMin    =  (RTC->TALM & RTC_TALM_TENMIN_Msk) >> RTC_TALM_TENMIN_Pos;
        g_u32loMin    =  (RTC->TALM & RTC_TALM_MIN_Msk)    >> RTC_TALM_MIN_Pos;

        u32Tmp  = (g_u32hiMin * 10);
        u32Tmp += g_u32loMin;
        sPt->u32Minute = u32Tmp;
    }
    if(RTC->TALM & RTC_TALM_MSKSEC_Msk)
        sPt->u32Second = RTC_ALARM_MASK;
    else
    {
        g_u32hiSec    =  (RTC->TALM & RTC_TALM_TENSEC_Msk) >> RTC_TALM_TENSEC_Pos;
        g_u32loSec    =  (RTC->TALM & RTC_TALM_SEC_Msk);

        u32Tmp  = (g_u32hiSec * 10);
        u32Tmp += g_u32loSec;
        sPt->u32Second = u32Tmp;
    }


    RTC->RWEN = 0;
    RTC_SyncReg();
}



/**
 *  @brief      This function is used to update date/time to RTC.
 *
 *  @param[in]  sPt \n
 *                     Specify the time property and current time. It includes:                          \n
 *                     u32Year: Year value.                                                               \n
 *                     u32Month: Month value.                                                             \n
 *                     u32Day: Day value.                                                                 \n
 *                     u32DayOfWeek: Day of week. [ \ref RTC_SUNDAY / \ref RTC_MONDAY / \ref RTC_TUESDAY /
 *                                                  \ref RTC_WEDNESDAY / \ref RTC_THURSDAY / \ref RTC_FRIDAY /
 *                                                  \ref RTC_SATURDAY]                                       \n
 *                     u32Hour: Hour value.                                                               \n
 *                     u32Minute: Minute value.                                                           \n
 *                     u32Second: Second value.                                                           \n
 *                     u32TimeScale: [ \ref RTC_CLOCK_12 / \ref RTC_CLOCK_24]                                  \n
 *                     u8AmPm: [ \ref RTC_AM / \ref RTC_PM]                                                    \n
 *
 *  @return     None
 *
 *
 */
void RTC_SetDateAndTime(S_RTC_TIME_DATA_T *sPt)
{
    uint32_t u32Reg;
    RTC->INIT = RTC_INIT_KEY;
    RTC_SyncReg();

