OpenNuvoton/NUC505BSP/Library/StdDriver/src/rtc.c
    RTC->RWEN = RTC_WRITE_KEY;
    while(!(RTC->RWEN & RTC_RWEN_RWENF_Msk));
    RTC_SyncReg();

    if (sPt->u32TimeScale == RTC_CLOCK_12)
    {
        RTC->CLKFMT &= ~RTC_CLKFMT_24HEN_Msk;
        RTC_SyncReg();
        /*-----------------------------------------------------------------------------------------*/
        /* important, range of 12-hour PM mode is 21 up to 32                                      */
        /*-----------------------------------------------------------------------------------------*/
        if (sPt->u32AmPm == RTC_PM)
            sPt->u32Hour += 20;
    }
    else                                                                  /* RTC_CLOCK_24 */
    {
        RTC->CLKFMT |= RTC_CLKFMT_24HEN_Msk;
        RTC_SyncReg();
    }

    RTC->WEEKDAY = sPt->u32DayOfWeek & RTC_WEEKDAY_WEEKDAY_Msk;
    RTC_SyncReg();
    u32Reg     = ((sPt->u32Year - RTC_YEAR2000) / 10) << 20;
    u32Reg    |= (((sPt->u32Year - RTC_YEAR2000) % 10) << 16);
    u32Reg    |= ((sPt->u32Month  / 10) << 12);
    u32Reg    |= ((sPt->u32Month  % 10) << 8);
    u32Reg    |= ((sPt->u32Day    / 10) << 4);
    u32Reg    |=  (sPt->u32Day    % 10);
    g_u32Reg = u32Reg;

    RTC->CAL = (uint32_t)g_u32Reg;
    RTC_SyncReg();

    u32Reg     = ((sPt->u32Hour   / 10) << 20);
    u32Reg    |= ((sPt->u32Hour   % 10) << 16);
    u32Reg    |= ((sPt->u32Minute / 10) << 12);
    u32Reg    |= ((sPt->u32Minute % 10) << 8);
    u32Reg    |= ((sPt->u32Second / 10) << 4);
    u32Reg    |=  (sPt->u32Second % 10);
    g_u32Reg = u32Reg;

    RTC->TIME = (uint32_t)g_u32Reg;
    RTC_SyncReg();

    RTC->RWEN = 0;
    RTC_SyncReg();
}

/**
 *  @brief      This function is used to set alarm date/time to RTC.
 *
 *  @param[in]  sPt \n
 *                     Specify the time property and current time. It includes:                          \n
 *                     u32Year: Year value.                                                               \n
 *                     u32Month: Month value.                                                             \n
 *                     u32Day: Day value.                                                                 \n
 *                     u32DayOfWeek: Day of week. [ \ref RTC_SUNDAY / \ref RTC_MONDAY / \ref RTC_TUESDAY /
 *                                                  \ref RTC_WEDNESDAY / \ref RTC_THURSDAY / \ref RTC_FRIDAY /
 *                                                  \ref RTC_SATURDAY]                                       \n
 *                     u32Hour: Hour value.                                                               \n
 *                     u32Minute: Minute value.                                                           \n
 *                     u32Second: Second value.                                                           \n
 *                     u32TimeScale: [ \ref RTC_CLOCK_12 / \ref RTC_CLOCK_24]                                  \n
 *                     u8AmPm: [ \ref RTC_AM / \ref RTC_PM]                                                    \n
 *
 *
 *  @return     None
 *
 *  @note        If the parameter is 0xFF, RTC alarm mask for the field will be enabled and it also return 0xFF when user reads back the values.                                                \n
 */
void RTC_SetAlarmDateAndTime(S_RTC_TIME_DATA_T *sPt)
{
    uint32_t u32Reg;
    RTC->INIT = RTC_INIT_KEY;
    RTC_SyncReg();

    RTC->RWEN = RTC_WRITE_KEY;
    while(!(RTC->RWEN & RTC_RWEN_RWENF_Msk));
    RTC_SyncReg();

    if (sPt->u32TimeScale == RTC_CLOCK_12)
    {
        RTC->CLKFMT &= ~RTC_CLKFMT_24HEN_Msk;
        RTC_SyncReg();
        /*-----------------------------------------------------------------------------------------*/
        /* important, range of 12-hour PM mode is 21 up to 32                                      */
        /*-----------------------------------------------------------------------------------------*/
        if (sPt->u32AmPm == RTC_PM)
            sPt->u32Hour += 20;
    }
    else                                                                  /* RTC_CLOCK_24 */
    {
        RTC->CLKFMT |= RTC_CLKFMT_24HEN_Msk;
        RTC_SyncReg();
    }
    u32Reg = 0;

    if(sPt->u32DayOfWeek == RTC_ALARM_MASK)
        u32Reg |= RTC_CALM_MSKWEEKDAY_Msk;
    else
        u32Reg = (sPt->u32DayOfWeek << RTC_CALM_WEEKDAY_Pos) & RTC_CALM_WEEKDAY_Msk;

    if(sPt->u32Year == RTC_ALARM_MASK)
        u32Reg |= RTC_CALM_MSKYEAR_Msk;
    else
    {
        u32Reg    |= ((sPt->u32Year - RTC_YEAR2000) / 10) << 20;
        u32Reg    |= (((sPt->u32Year - RTC_YEAR2000) % 10) << 16);
    }
    if(sPt->u32Month == RTC_ALARM_MASK)
        u32Reg |= RTC_CALM_MSKMON_Msk;
    else
    {
        u32Reg    |= ((sPt->u32Month  / 10) << 12);
        u32Reg    |= ((sPt->u32Month  % 10) << 8);
    }
    if(sPt->u32Day == RTC_ALARM_MASK)
        u32Reg |= RTC_CALM_MSKDAY_Msk;
    else
    {
        u32Reg    |= ((sPt->u32Day     / 10) << 4);
        u32Reg    |=  (sPt->u32Day    % 10);
    }
    g_u32Reg   = u32Reg;

    RTC->CALM = (uint32_t)g_u32Reg;
    RTC_SyncReg();

    u32Reg = 0;
    if(sPt->u32Hour == RTC_ALARM_MASK)
        u32Reg |= RTC_TALM_MSKHR_Msk;
    else
    {
        u32Reg    |= ((sPt->u32Hour   / 10) << 20);
        u32Reg    |= ((sPt->u32Hour   % 10) << 16);
    }
    if(sPt->u32Minute == RTC_ALARM_MASK)
        u32Reg |= RTC_TALM_MSKMIN_Msk;
    else
    {
        u32Reg    |= ((sPt->u32Minute / 10) << 12);
        u32Reg    |= ((sPt->u32Minute % 10) << 8);
    }
    if(sPt->u32Second == RTC_ALARM_MASK)
        u32Reg |= RTC_TALM_MSKSEC_Msk;
    else
    {
        u32Reg    |= ((sPt->u32Second / 10) << 4);
        u32Reg    |=  (sPt->u32Second % 10);
    }
    g_u32Reg = u32Reg;

    RTC->TALM = (uint32_t)g_u32Reg;
    RTC_SyncReg();

    u32Reg = RTC->POWCTL | RTC_POWCTL_ALMIEN_Msk;
    RTC->POWCTL =  u32Reg;
    RTC_SyncReg();

    RTC->RWEN = 0;
    RTC_SyncReg();
}


/**
 *  @brief      This function is used to update date to RTC
 *
 *  @param[in]  u32Year       The Year Calendar Digit of Alarm Setting                           \n
 *  @param[in]  u32Month      The Month Calendar Digit of Alarm Setting                           \n
 *  @param[in]  u32Day        The Day Calendar Digit of Alarm Setting                             \n
 *  @param[in]  u32DayOfWeek  The Day of Week. [ \ref RTC_SUNDAY / \ref RTC_MONDAY / \ref RTC_TUESDAY /
 *                                                 \ref RTC_WEDNESDAY / \ref RTC_THURSDAY / \ref RTC_FRIDAY /
 *                                                 \ref RTC_SATURDAY]                                          \n
 *
 *  @return     None
 *
 */
void RTC_SetDate(uint32_t u32Year, uint32_t u32Month, uint32_t u32Day, uint32_t u32DayOfWeek)
{
    __IO uint32_t u32Reg;
    RTC->INIT = RTC_INIT_KEY;
    RTC_SyncReg();

