OpenNuvoton/NUC505BSP/Library/StdDriver/src/rtc.c
    RTC->RWEN = RTC_WRITE_KEY;
    while(!(RTC->RWEN & RTC_RWEN_RWENF_Msk));
    RTC_SyncReg();

    RTC->WEEKDAY = u32DayOfWeek & RTC_WEEKDAY_WEEKDAY_Msk;
    RTC_SyncReg();

    u32Reg     = ((u32Year - RTC_YEAR2000) / 10) << 20;
    u32Reg    |= (((u32Year - RTC_YEAR2000) % 10) << 16);
    u32Reg    |= ((u32Month  / 10) << 12);
    u32Reg    |= ((u32Month  % 10) << 8);
    u32Reg    |= ((u32Day    / 10) << 4);
    u32Reg    |=  (u32Day    % 10);
    g_u32Reg   = u32Reg;

    RTC->CAL = (uint32_t)g_u32Reg;
    RTC_SyncReg();

    RTC->RWEN = 0;
    RTC_SyncReg();
}

/**
 *  @brief      This function is used to update time to RTC.                                     \n
 *                                                                                               \n
 *  @param[in]    u32Hour     The Hour Time Digit of Alarm Setting.
 *  @param[in]    u32Minute   The Month Calendar Digit of Alarm Setting
 *  @param[in]    u32Second   The Day Calendar Digit of Alarm Setting
 *  @param[in]    u32TimeMode The 24-Hour / 12-Hour Time Scale Selection. [ \ref RTC_CLOCK_12 / \ref RTC_CLOCK_24]
 *  @param[in]    u32AmPm     12-hour time scale with AM and PM indication. Only Time Scale select 12-hour used. [ \ref RTC_AM / \ref RTC_PM]
 *
 *  @return     None
 *
 */
void RTC_SetTime(uint32_t u32Hour, uint32_t u32Minute, uint32_t u32Second, uint32_t u32TimeMode, uint32_t u32AmPm)
{
    __IO uint32_t u32Reg;
    RTC->INIT = RTC_INIT_KEY;
    RTC_SyncReg();

    RTC->RWEN = RTC_WRITE_KEY;
    while(!(RTC->RWEN & RTC_RWEN_RWENF_Msk));
    RTC_SyncReg();

    if (u32TimeMode == RTC_CLOCK_12)
    {
        RTC->CLKFMT &= ~RTC_CLKFMT_24HEN_Msk;
        RTC_SyncReg();

        if (u32AmPm == RTC_PM)    /* important, range of 12-hour PM mode is 21 up to 32 */
            u32Hour += 20;
    }
    else if(u32TimeMode == RTC_CLOCK_24)
    {
        RTC->CLKFMT |= RTC_CLKFMT_24HEN_Msk;
        RTC_SyncReg();
    }

    u32Reg     = ((u32Hour   / 10) << 20);
    u32Reg    |= ((u32Hour   % 10) << 16);
    u32Reg    |= ((u32Minute / 10) << 12);
    u32Reg    |= ((u32Minute % 10) << 8);
    u32Reg    |= ((u32Second / 10) << 4);
    u32Reg    |=  (u32Second % 10);

    g_u32Reg = u32Reg;

    RTC->TIME = (uint32_t)g_u32Reg;
    RTC_SyncReg();

    RTC->RWEN = 0;
    RTC_SyncReg();
}

/**
 *  @brief      This function is used to set alarm date to RTC
 *
 *  @param[in]      u32Year    The Year Calendar Digit of Alarm Setting
 *  @param[in]      u32Month   The Month Calendar Digit of Alarm Setting
 *  @param[in]      u32Day     The Day Calendar Digit of Alarm Setting
 *
 *  @return      None
 *
 *  @ note       If the parameter is 0xFF, RTC alarm mask for the field will be enabled and it also return 0xFF when user reads back the values.\n
 *               For example: RTC_SetAlarmDate(0xFF, 0xFF, 2); The alarm occurs monthly 2nd.
 */

void RTC_SetAlarmDate(uint32_t u32Year, uint32_t u32Month, uint32_t u32Day)
{
    __IO uint32_t u32Reg;
    RTC->INIT = RTC_INIT_KEY;
    RTC_SyncReg();

    RTC->RWEN = RTC_WRITE_KEY;
    while(!(RTC->RWEN & RTC_RWEN_RWENF_Msk));
    RTC_SyncReg();

    u32Reg = RTC_CALM_MSKWEEKDAY_Msk; /* Always enable Weekday Mask*/

    if(u32Year == RTC_ALARM_MASK)
        u32Reg |= RTC_CALM_MSKYEAR_Msk;
    else
    {
        u32Reg    |= ((u32Year - RTC_YEAR2000) / 10) << 20;
        u32Reg    |= (((u32Year - RTC_YEAR2000) % 10) << 16);
    }
    if(u32Month == RTC_ALARM_MASK)
        u32Reg |= RTC_CALM_MSKMON_Msk;
    else
    {
        u32Reg    |= ((u32Month  / 10) << 12);
        u32Reg    |= ((u32Month  % 10) << 8);
    }
    if(u32Day == RTC_ALARM_MASK)
        u32Reg |= RTC_CALM_MSKDAY_Msk;
    else
    {
        u32Reg    |= ((u32Day / 10) << 4);
        u32Reg    |=  (u32Day % 10);
    }
    g_u32Reg   = u32Reg;

    RTC->CALM = (uint32_t)g_u32Reg;
    RTC_SyncReg();

    u32Reg = RTC->POWCTL | RTC_POWCTL_ALMIEN_Msk;
    RTC->POWCTL =  u32Reg;
    RTC_SyncReg();

    RTC->RWEN = 0;
    RTC_SyncReg();
}

/**
 *  @brief      This function is used to set alarm date to RTC
 *
 *  @param[in]     u32Hour     The Hour Time Digit of Alarm Setting.
 *  @param[in]     u32Minute   The Minute Time Digit of Alarm Setting
 *  @param[in]     u32Second   The Second Time Digit of Alarm Setting
 *  @param[in]     u32TimeMode The 24-Hour / 12-Hour Time Scale Selection. [ \ref RTC_CLOCK_12 / \ref RTC_CLOCK_24]
 *  @param[in]     u32AmPm     12-hour time scale with AM and PM indication. Only Time Scale select 12-hour used. [ \ref RTC_AM / \ref RTC_PM]
 *
 *  @return        None
 *
 *  @note       If the parameter is 0xFF, RTC alarm mask for the field will be enabled and it also return 0xFF when user reads back the values.
 *              For example: The alarm occurs when 20xx/xx/02 00:00:10.
 *                 RTC_SetAlarmDate(0xFF, 0xFF, 2); \n
 *                 RTC_ SetAlarmTime (0xFF, 0xFF, 10);
 */
void RTC_SetAlarmTime(uint32_t u32Hour, uint32_t u32Minute, uint32_t u32Second, uint32_t u32TimeMode, uint32_t u32AmPm)
{
    __IO uint32_t u32Reg;
    RTC->INIT = RTC_INIT_KEY;
    RTC_SyncReg();

    RTC->RWEN = RTC_WRITE_KEY;
    while(!(RTC->RWEN & RTC_RWEN_RWENF_Msk));
    RTC_SyncReg();

    if (u32TimeMode == RTC_CLOCK_12)
    {
        RTC->CLKFMT &= ~RTC_CLKFMT_24HEN_Msk;
        RTC_SyncReg();

        if (u32AmPm == RTC_PM)    /* important, range of 12-hour PM mode is 21 up to 32 */
            u32Hour += 20;
    }
    else if(u32TimeMode == RTC_CLOCK_24)
    {
        RTC->CLKFMT |= RTC_CLKFMT_24HEN_Msk;
        RTC_SyncReg();
    }

    u32Reg = 0;
    if(u32Hour == RTC_ALARM_MASK)
        u32Reg |= RTC_TALM_MSKHR_Msk;
    else
    {
        u32Reg    |= ((u32Hour / 10) << 20);
        u32Reg    |= ((u32Hour % 10) << 16);
    }
    if(u32Minute == RTC_ALARM_MASK)
        u32Reg |= RTC_TALM_MSKMIN_Msk;
    else
    {
        u32Reg    |= ((u32Minute / 10) << 12);
        u32Reg    |= ((u32Minute % 10) << 8);
    }
    if(u32Second == RTC_ALARM_MASK)
        u32Reg |= RTC_TALM_MSKSEC_Msk;
    else
    {
        u32Reg    |= ((u32Second / 10) << 4);
        u32Reg    |=  (u32Second % 10);
    }
    g_u32Reg = u32Reg;

